W12D2/bench/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "8MhrMUy7x6CRNIJ5WG_FyA"], ["LIMIT", 1]]
---
  def current_user
    @current_user ||= User.find_by(session_token: session[:session_token])