W6D5/ninety_nine_cats/app/controllers/cats_controller.rb

INSERT INTO "cats" ("name", "sex", "color", "birth_date", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @cat = Cat.new(cat_params)
    if @cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "color" = $2, "birth_date" = $3, "description" = $4, "updated_at" = $5 WHERE "cats"."id" = $6  [["name", "Sunshine"], ["color", "unicorn"], ["birth_date", "2020-07-30"], ["description", "jolly cat"], ["updated_at", "2022-02-06 03:35:35.875449"], ["id", 7]]
---
  def update
    @cat = Cat.find(params[:id])
    if @cat.update_attributes(cat_params)