W12D2/bench/app/models/user.rb

  def self.find_by_credentials(username, password)
    user = User.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "test"], ["LIMIT", 1]]

  def reset_session_token!
    self.session_token = SecureRandom::urlsafe_base64
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "sEBAV4lKiNA33Ly6mvKUoQ"], ["updated_at", "2022-03-16 18:05:38.802035"], ["id", 2]]