W6D3/first_routes/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 3], ["viewer_id", 2], ["created_at", "2022-02-03 19:29:20.297423"], ["updated_at", "2022-02-03 19:29:20.297423"]]
---
  def create
    artwork_share = ArtworkShare.new(artwork_shares_params)
    if artwork_share.save

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 3]]
---
  def destroy
    artwork_share = ArtworkShare.find(params[:id])
    if artwork_share.destroy