W6D3/first_routes/app/controllers/artworks_controller.rb

    def index
        if params.has_key?(:artist_id)
            artwork = Artwork.where(artist_id: params[:artist_id])
            render json: artwork
        else
            render json: Artwork.all
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 1]]
SELECT "artworks".* FROM "artworks"

    def create
        artwork = Artwork.new(artwork_params)
        debugger
        if artwork.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "'Blop blip bloop'"], ["image_url", "google.com/blopblipbloop"], ["artist_id", 1], ["created_at", "2022-02-03 18:42:54.912178"], ["updated_at", "2022-02-03 18:42:54.912178"]]