W6D3/first_routes/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 2]]
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 2]]
---
  def index
    if params[:artwork_id]
    comment = Comment.where(artwork_id: params[:artwork_id])
    else
    comment = Comment.where(user_id: params[:user_id])

INSERT INTO "comments" ("body", "user_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "kdjgndjngh"], ["user_id", 1], ["artwork_id", 3], ["created_at", "2022-02-04 00:37:52.747638"], ["updated_at", "2022-02-04 00:37:52.747638"]]
---
  def create
    comment = Comment.new(com_params)
    if comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 2]]
---
  def destroy
    comment = Comment.find(params[:id])
    if comment.destroy