W11D2/todos/Todos/app/controllers/api/todos_controller.rb

  def create
    @todo = Todo.new(todo_params)
    if @todo.save
---
INSERT INTO "todos" ("title", "body", "done", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "uygjhjg"], ["body", "hgjghjghj"], ["done", false], ["created_at", "2022-03-11 00:38:58.640413"], ["updated_at", "2022-03-11 00:38:58.640413"]]